{
  "header": {
    "title": "My amazing website"
  },
  "sections": [
    {
      "id": 1,
      "title": "Section 1",
      "text": "On the other hand, we denounce with righteous indignation and dislike men who are so beguiled and demoralized by the charms of pleasure of the moment, so blinded by desire, that they cannot foresee the pain and trouble that are bound to ensue; and equal blame belongs to those who fail in their duty through weakness of will, which is the same as saying through shrinking from toil and pain. Vitae sapien pellentesque habitant morbi tristique senectus et netus. Duis ultricies lacus sed turpis tincidunt id aliquet risus feugiat. Vulputate eu scelerisque felis imperdiet proin fermentum leo vel. Eu nisl nunc mi ipsum faucibus vitae. Feugiat sed lectus vestibulum mattis ullamcorper velit sed ullamcorper. Dictum non consectetur a erat nam at lectus urna. Consectetur adipiscing elit ut aliquam purus sit. Morbi tristique senectus et netus et malesuada fames. Etiam non quam lacus suspendisse faucibus interdum posuere. Enim praesent elementum facilisis leo vel. Interdum varius sit amet mattis vulputate enim nulla aliquet porttitor. Aliquet enim tortor at auctor urna. Sit amet mattis vulputate enim nulla aliquet porttitor. Accumsan sit amet nulla facilisi morbi tempus. Sed viverra ipsum nunc aliquet. Gravida rutrum quisque non tellus orci ac auctor augue. Sed id semper risus in hendrerit gravida. Nulla posuere sollicitudin aliquam ultrices sagittis orci. Dignissim enim sit amet venenatis urna. Odio ut sem nulla pharetra diam sit. Vel elit scelerisque mauris pellentesque pulvinar pellentesque habitant. Ut placerat orci nulla pellentesque dignissim enim sit. Rhoncus dolor purus non enim. Volutpat sed cras ornare arcu dui vivamus. Interdum velit euismod in pellentesque massa placerat. Vitae ultricies leo integer malesuada nunc vel risus commodo. Urna molestie at elementum eu facilisis sed odio. Pellentesque nec nam aliquam sem. Nunc scelerisque viverra mauris in aliquam sem fringilla. Fringilla est ullamcorper eget nulla. Eu lobortis elementum nibh tellus. In tellus integer feugiat scelerisque varius morbi enim nunc. Sem et tortor consequat id porta nibh venenatis cras. Tincidunt arcu non sodales neque sodales ut etiam sit amet. Mattis ullamcorper velit sed ullamcorper morbi tincidunt ornare massa. Nibh sit amet commodo nulla. Ipsum consequat nisl vel pretium lectus quam id leo. Vitae elementum curabitur vitae nunc sed velit dignissim sodales. Ac felis donec et odio pellentesque. Dictum sit amet justo donec enim diam vulputate. Libero id faucibus nisl tincidunt eget nullam non. Nascetur ridiculus mus mauris vitae ultricies. Lectus nulla at volutpat diam ut venenatis tellus in metus. Egestas purus viverra accumsan in nisl nisi scelerisque. Ut diam quam nulla porttitor massa. Arcu ac tortor dignissim convallis. Cras pulvinar mattis nunc sed blandit. Urna porttitor rhoncus dolor purus non enim praesent elementum facilisis. Sem nulla pharetra diam sit amet nisl. Egestas erat imperdiet sed euismod nisi porta lorem mollis. Sed vulputate mi sit amet mauris commodo quis imperdiet massa. Gravida quis blandit turpis cursus. A pellentesque sit amet porttitor eget dolor morbi. Odio eu feugiat pretium nibh ipsum. Pretium aenean pharetra magna ac placerat. Sed cras ornare arcu dui vivamus arcu felis bibendum ut. Urna nec tincidunt praesent semper feugiat nibh. Scelerisque varius morbi enim nunc faucibus a pellentesque. Turpis egestas maecenas pharetra convallis. Et malesuada fames ac turpis egestas. Egestas congue quisque egestas diam. Enim diam vulputate ut pharetra sit amet aliquam id. Sed risus ultricies tristique nulla aliquet enim. Ac placerat vestibulum lectus mauris ultrices eros in cursus turpis. Augue neque gravida in fermentum et sollicitudin ac orci. Et sollicitudin ac orci phasellus egestas tellus rutrum. Volutpat maecenas volutpat blandit aliquam etiam. Ultrices gravida dictum fusce ut. Fermentum et sollicitudin ac orci phasellus egestas tellus. Risus ultricies tristique nulla aliquet. Dignissim sodales ut eu sem integer vitae. Morbi tempus iaculis urna id volutpat. Rhoncus urna neque viverra justo nec ultrices dui sapien. Placerat orci nulla pellentesque dignissim enim. Nisl nisi scelerisque eu ultrices vitae auctor eu augue ut. Odio morbi quis commodo odio. Pellentesque elit ullamcorper dignissim cras tincidunt lobortis feugiat vivamus at. Congue mauris rhoncus aenean vel elit scelerisque mauris pellentesque pulvinar. Commodo ullamcorper a lacus vestibulum. At in tellus integer feugiat scelerisque varius morbi enim. Diam in arcu cursus euismod quis. Id ornare arcu odio ut. Consectetur adipiscing elit duis tristique sollicitudin nibh sit amet. Morbi tristique senectus et netus et malesuada fames ac. Fringilla urna porttitor rhoncus dolor purus non enim. Arcu non sodales neque sodales ut etiam sit amet nisl. Duis convallis velit a aliquam tempor. Duis sit amet libero efficitur est dignissim tempor at a ipsum. Suspendisse quis ipsum faucibus, aliquet erat sit amet, tincidunt erat. Pellentesque porta, sem a placerat fermentum, dui urna auctor lectus, ut rhoncus tortor odio id libero. Etiam condimentum hendrerit libero. Donec mi sem, fermentum eu interdum eget, pulvinar at est. Vivamus a augue dolor. In consectetur, diam quis pulvinar lacinia, ipsum lectus tincidunt leo, vel consectetur ligula velit a urna. Mauris lobortis orci eu purus eleifend, vitae vehicula mauris vehicula. In a lorem et justo euismod imperdiet. Nunc non tristique libero, non viverra leo. Sed aliquam vestibulum velit, et ultricies orci interdum et. Donec venenatis iaculis lobortis. Nulla accumsan purus id velit placerat, auctor euismod orci blandit. Ut consectetur justo a tellus ornare, nec vehicula tortor hendrerit. Proin at lectus felis. These cases are perfectly simple and easy to distinguish. In a free hour, when our power of choice is untrammelled and when nothing prevents our being able to do what we like best, every pleasure is to be welcomed and every pain avoided. But in certain circumstances and owing to the claims of duty or the obligations of business it will frequently occur that pleasures have to be repudiated and annoyances accepted. The wise man therefore always holds in these matters to this principle of selection: he rejects pleasures to secure other greater pleasures, or else he endures pains to avoid worse pains. But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. Nor again is there anyone who loves or pursues or desires to obtain pain of itself, because it is pain, but because occasionally circumstances occur in which toil and pain can procure him some great pleasure. To take a trivial example, which of us ever undertakes laborious physical exercise, except to obtain some advantage from it? But who has any right to find fault with a man who chooses to enjoy a pleasure that has no annoying consequences, or one who avoids a pain that produces no resultant pleasure?"
    },
    {
      "id": 2,
      "title": "Section 2",
      "text": "But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. Proin suscipit nunc in felis convallis, id auctor ex accumsan. Curabitur a turpis auctor, vestibulum tellus a, dapibus est. Duis suscipit odio at ante porttitor suscipit. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Praesent euismod purus sit amet consectetur vehicula. Donec sit amet nulla orci. Cras euismod ut sapien id pulvinar. Sed a lorem nec quam convallis tempus eget id justo. Phasellus malesuada massa vulputate, convallis eros et, feugiat nibh. Ut dictum arcu sit amet velit facilisis, eu mollis erat blandit. Eu nisl nunc mi ipsum faucibus vitae. Feugiat sed lectus vestibulum mattis ullamcorper velit sed ullamcorper. Dictum non consectetur a erat nam at lectus urna. Consectetur adipiscing elit ut aliquam purus sit. Morbi tristique senectus et netus et malesuada fames. Etiam non quam lacus suspendisse faucibus interdum posuere. Enim praesent elementum facilisis leo vel. Interdum varius sit amet mattis vulputate enim nulla aliquet porttitor. Aliquet enim tortor at auctor urna. Sit amet mattis vulputate enim nulla aliquet porttitor. Accumsan sit amet nulla facilisi morbi tempus. Sed viverra ipsum nunc aliquet. Gravida rutrum quisque non tellus orci ac auctor augue. Leo a diam sollicitudin tempor id eu nisl nunc mi. Facilisi cras fermentum odio eu feugiat pretium nibh ipsum. Integer enim neque volutpat ac tincidunt vitae semper quis. Nam at lectus urna duis. Urna molestie at elementum eu facilisis sed odio. Vitae ultricies leo integer malesuada nunc vel. Nullam vehicula ipsum a arcu. Odio aenean sed adipiscing diam donec adipiscing. Morbi quis commodo odio aenean sed adipiscing diam donec. Nisi est sit amet facilisis magna etiam. Diam quis enim lobortis scelerisque fermentum dui. Commodo elit at imperdiet dui accumsan. Sapien pellentesque habitant morbi tristique senectus et netus. Sed faucibus turpis in eu mi bibendum. Urna nec tincidunt praesent semper. Eu nisl nunc mi ipsum faucibus vitae. Feugiat sed lectus vestibulum mattis ullamcorper velit sed ullamcorper. Dictum non consectetur a erat nam at lectus urna. Consectetur adipiscing elit ut aliquam purus sit. Morbi tristique senectus et netus et malesuada fames. Etiam non quam lacus suspendisse faucibus interdum posuere. Enim praesent elementum facilisis leo vel. Interdum varius sit amet mattis vulputate enim nulla aliquet porttitor. Aliquet enim tortor at auctor urna. Sit amet mattis vulputate enim nulla aliquet porttitor. Accumsan sit amet nulla facilisi morbi tempus. Sed viverra ipsum nunc aliquet. Gravida rutrum quisque non tellus orci ac auctor augue. Sed id semper risus in hendrerit gravida. Nulla posuere sollicitudin aliquam ultrices sagittis orci. Dignissim enim sit amet venenatis urna. Odio ut sem nulla pharetra diam sit. Sed id semper risus in hendrerit gravida. Nulla posuere sollicitudin aliquam ultrices sagittis orci. Eget nunc scelerisque viverra mauris in aliquam sem fringilla. Quis enim lobortis scelerisque fermentum dui. Ullamcorper dignissim cras tincidunt lobortis feugiat vivamus at augue eget. Dignissim enim sit amet venenatis urna. Nibh tellus molestie nunc non blandit massa. Imperdiet massa tincidunt nunc pulvinar. Enim nulla aliquet porttitor lacus luctus. Enim tortor at auctor urna nunc. Vitae auctor eu augue ut lectus arcu. Ut sem viverra aliquet eget sit amet. Aliquet lectus proin nibh nisl condimentum id venenatis a. A condimentum vitae sapien pellentesque. Tempor orci eu lobortis elementum nibh. Egestas tellus rutrum tellus pellentesque eu tincidunt tortor aliquam. Cursus mattis molestie a iaculis at. Laoreet id donec ultrices tincidunt arcu non. Lacus vel facilisis volutpat est velit. Consequat semper viverra nam libero. Euismod elementum nisi quis eleifend quam adipiscing vitae. Nulla porttitor massa id neque aliquam vestibulum morbi. Ullamcorper sit amet risus nullam eget. Viverra orci sagittis eu volutpat. Amet massa vitae tortor condimentum lacinia quis. Nulla pharetra diam sit amet nisl suscipit adipiscing bibendum. Sit amet nisl suscipit adipiscing. Bibendum at varius vel pharetra vel turpis nunc. Vitae proin sagittis nisl rhoncus mattis rhoncus urna neque. Dignissim enim sit amet venenatis urna. Odio ut sem nulla pharetra diam sit. Nullam in lorem nec sem porta porttitor. Nor again is there anyone who loves or pursues or desires to obtain pain of itself, because it is pain, but because occasionally circumstances occur in which toil and pain can procure him some great pleasure. To take a trivial example, which of us ever undertakes laborious physical exercise, except to obtain some advantage from it? But who has any right to find fault with a man who chooses to enjoy a pleasure that has no annoying consequences, or one who avoids a pain that produces no resultant pleasure? On the other hand, we denounce with righteous indignation and dislike men who are so beguiled and demoralized by the charms of pleasure of the moment, so blinded by desire, that they cannot foresee the pain and trouble that are bound to ensue; and equal blame belongs to those who fail in their duty through weakness of will, which is the same as saying through shrinking from toil and pain. These cases are perfectly simple and easy to distinguish. In a free hour, when our power of choice is untrammelled and when nothing prevents our being able to do what we like best, every pleasure is to be welcomed and every pain avoided. But in certain circumstances and owing to the claims of duty or the obligations of business it will frequently occur that pleasures have to be repudiated and annoyances accepted. The wise man therefore always holds in these matters to this principle of selection: he rejects pleasures to secure other greater pleasures, or else he endures pains to avoid worse pains."
    }
  ]
}